Revit 2027 API
BuiltInFailures.SiteFailures.SiteRegionOptionConflict Property
 Subregions must be in the same Design Option as their Toposurface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SiteRegionOptionConflict { get; }
Public Shared ReadOnly Property SiteRegionOptionConflict As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SiteRegionOptionConflict {
	FailureDefinitionId^ get ();
}
static member SiteRegionOptionConflict : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace